maksidze/SmartESC_STM32_M365/Core/Src/main.c
#if KX
  HAL_GPIO_WritePin(OFF_PORT, OFF_PIN, GPIO_PIN_SET);   // Activate Latch
#endif

	Input_Lim_Init();   // Input Limitations Init
	Input_Init();       // Input Init

	HAL_ADC_Start(&hadc1);
	HAL_ADC_Start(&hadc2);

#if KX
  poweronMelody();
  HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_SET);
#endif

	board_temp_adcFixdt = adc_buffer.temp << 16; // Fixed-point filter output initialized with current ADC converted to fixed-point
	board_temp_adcFilt = adc_buffer.temp;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1) {

		HAL_Delay(DELAY_IN_MAIN_LOOP);        //delay in ms

#if TEST_READ_UART_COMMANDS
		readCommand();                        // Read Command: cmd1, cmd2
#endif

#if TEST_AUTOSTART
		if (main_loop_counter < 500) {
			cmdThrottle = main_loop_counter;
		}
		else
		{
			cmdThrottle =  500;
		}
#endif

#if TEST_LOOP

		if (main_loop_counter % LOOP_INC < LOOP_INC / 3) {
			cmdThrottle++;
		} else if (main_loop_counter % LOOP_INC < LOOP_INC * 2 / 3) {

		} else {
			cmdThrottle--;
		}
#endif

		calcAvgSpeed(); // Calculate average measured speed: speedAvg, speedAvgAbs

		// ####### MOTOR ENABLING: Only if the initial input is very small (for SAFETY) #######
		if (enable == 0 && (!rtY_Motor.z_errCode)
				&& (cmdBrake > -50 && cmdBrake < 50)) {
			brakeFixdt = speedFixdt = 0;      // reset filters
			enable = 1;                       // enable motors
		}

		speedBlend = (uint16_t) (((CLAMP(speedAvgAbs,10,60) - 10) << 15) / 50); // speedBlend [0,1] is within [10 rpm, 60rpm]

#ifdef STANDSTILL_HOLD_ENABLE
		standstillHold(); // Apply Standstill Hold functionality. Only available and makes sense for VOLTAGE or TORQUE Mode
#endif

		if (cmdBrake > 30) { // If Brake pedal (cmd1) is pressed, bring to 0 also the Throttle pedal (cmd2) to avoid "Double pedal" driving
			cmdThrottle = (int16_t) ((cmdThrottle * speedBlend) >> 15);
			cruiseControl((uint8_t) rtP_Left.b_cruiseCtrlEna); // Cruise control deactivated by Brake pedal if it was active
		}

#ifdef ELECTRIC_BRAKE_ENABLE
		electricBrake(speedBlend); // Apply Electric Brake. Only available and makes sense for TORQUE Mode
#endif

	    if (speedAvg > 0) { // Make sure the Brake pedal is opposite to the direction of motion AND it goes to 0 as we reach standstill (to avoid Reverse driving by Brake pedal)
			cmdBrake = (int16_t) ((cmdBrake * speedBlend) >> 15);
		} else {
			cmdBrake = (int16_t) ((-cmdBrake * speedBlend) >> 15);
		}

		// ####### LOW-PASS FILTER #######
		rateLimiter16(cmdBrake, RATE, &brakeRateFixdt);
		rateLimiter16(cmdThrottle, RATE, &speedRateFixdt);
		filtLowPass32(brakeRateFixdt >> 4, FILTER, &brakeFixdt);
		filtLowPass32(speedRateFixdt >> 4, FILTER, &speedFixdt);
		brake = (int16_t) (brakeFixdt >> 16);  // convert fixed-point to integer
		throttle = (int16_t) (speedFixdt >> 16);  // convert fixed-point to integer

		// ####### MIXER for electric braking #######
		mixerFcn(throttle << 4, brake << 4, &speedMotor); // This function implements the equations above

		// ####### SET OUTPUTS (if the target change is less than +/- 100) #######
		if (speedMotor > lastSpeedMotor - 100
				&& speedMotor < lastSpeedMotor + 100) {
			pwm = speedMotor;
		}

		// ####### CALC BOARD TEMPERATURE #######
		filtLowPass32(adc_buffer.temp, TEMP_FILT_COEF, &board_temp_adcFixdt);
		board_temp_adcFilt = (int16_t) (board_temp_adcFixdt >> 16); // convert fixed-point to integer
		board_temp_deg_c = NTC_ADC2Temperature(board_temp_adcFilt);

		// ####### FEEDBACK SERIAL OUT TO DISPLAY #######
		if (main_loop_counter % 4 == 0) {  // Send data periodically every 20 ms
			usart_send_from_esc_to_display();
		}

#if KX
	    // ####### POWEROFF BY POWER-BUTTON #######
	    poweroffPressCheck();
	    // ####### BEEP AND EMERGENCY POWEROFF #######
	    if ((TEMP_POWEROFF_ENABLE && board_temp_deg_c >= TEMP_POWEROFF && speedAvgAbs < 20) || (batVoltage < BAT_DEAD && speedAvgAbs < 20)) {  // poweroff before mainboard burns OR low bat 3
	      poweroff();
	    } else if (rtY_Motor.z_errCode || rtY_Right.z_errCode) {                                           // 1 beep (low pitch): Motor error, disable motors
	      enable = 0;
	      beepCount(1, 24, 1);
	    } else if (timeoutFlagADC) {                                                                      // 2 beeps (low pitch): ADC timeout
	      beepCount(2, 24, 1);
	    } else if (timeoutFlagSerial) {                                                                   // 3 beeps (low pitch): Serial timeout
	      beepCount(3, 24, 1);
	    } else if (timeoutCnt > TIMEOUT) {                                                                // 4 beeps (low pitch): General timeout (PPM, PWM, Nunchuck)
	      beepCount(4, 24, 1);
	    } else if (TEMP_WARNING_ENABLE && board_temp_deg_c >= TEMP_WARNING) {                             // 5 beeps (low pitch): Mainboard temperature warning
	      beepCount(5, 24, 1);
	    } else if (BAT_LVL1_ENABLE && batVoltage < BAT_LVL1) {                                            // 1 beep fast (medium pitch): Low bat 1
	      beepCount(0, 10, 6);
	    } else if (BAT_LVL2_ENABLE && batVoltage < BAT_LVL2) {                                            // 1 beep slow (medium pitch): Low bat 2
	      beepCount(0, 10, 30);
	    } else if (BEEPS_BACKWARD && ((throttle < -50 && speedAvg < 0) || MultipleTapBrake.b_multipleTap)) { // 1 beep fast (high pitch): Backward spinning motors
	      beepCount(0, 5, 1);
	      backwardDrive = 1;
	    } else {  // do not beep
	      beepCount(0, 0, 0);
	      backwardDrive = 0;
	    }


	    // ####### INACTIVITY TIMEOUT #######
	    if (abs(speedMotor) > 50 || abs(speedR) > 50) {
	      inactivity_timeout_counter = 0;
	    } else {
	      inactivity_timeout_counter++;
	    }
	    if (inactivity_timeout_counter > (INACTIVITY_TIMEOUT * 60 * 1000) / (DELAY_IN_MAIN_LOOP + 1)) {  // rest of main loop needs maybe 1ms
	      poweroff();
	    }
#endif

#if DEBUG_LED == MAIN_LOOP
		HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, main_loop_counter % 100 > 50);
#endif

		// Update main loop states
		lastSpeedMotor = speedMotor;
		main_loop_counter++;
		timeoutCnt++;

		//HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin,				(main_loop_counter % 400 > 200));

    /* USER CODE END WHILE */

